# NewCurtainSystem2 Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewCurtainSystem2 Method
Document Class See Also
---
Creates a new CurtainSystem element from a set of face references.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ICollection<ElementId> NewCurtainSystem2(
	ReferenceArray faces,
	CurtainSystemType curtainSystemType
)
```

Visual Basic
---
```text
Public Function NewCurtainSystem2 ( _
	faces As ReferenceArray, _
	curtainSystemType As CurtainSystemType _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ NewCurtainSystem2(
	ReferenceArray^ faces,
	CurtainSystemType^ curtainSystemType
)
```

# ### Parameters
faces
    Type: Autodesk.Revit.DB..::..ReferenceArrayThe faces new CurtainSystem will be created on.
curtainSystemType
    Type: Autodesk.Revit.DB..::..CurtainSystemTypeThe Type of CurtainSystem to be created.
# ### Return Value
A set of ElementIds of CurtainSystems will be returned when the operation succeeds.
# Remarks
The faces can belong to different masses or generic models. The number of CurtainSystems will be equal to the number of masses and generic models.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown in following cases: The input argument faces or curtainSystemType is nullNothingnullptra null reference (Nothing in Visual Basic). The size of faces is zero. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the CurtainSystem cannot be created, for example, the input faces don't belong to same mass or generic model. Or regenerate fails. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the curtain system type does not exist in the given document. |

# See Also
Document Class
Autodesk.Revit.Creation Namespace